In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("adult.data.csv", index_col = 'race')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
race,,,,,,,,,,,,,,
White,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
White,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
White,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
Black,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
Black,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

### 1. How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (race column)

In [3]:
race_count = df.index.value_counts()
race_count

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

In [4]:
men = df[df['sex']=='Male']
average_age_men = men['age'].mean()
average_age_men

39.43354749885268

In [5]:
bachelors = df[df['education'] == 'Bachelors']
education_total = len(df)
education_bachelor = bachelors['education'].value_counts()

percentage_bachelors = education_bachelor / education_total * 100

### 2. What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?

In [6]:
higher_education_check = (df['education'] == 'Bachelors') | (df['education'] == 'Masters') | (df['education'] == 'Doctorate')

In [7]:
df_higheredu = df[higher_education_check]
higheredu_total = len(df_higheredu)
higheredu_total

7491

In [8]:
high_salary_50k = df_higheredu['salary'] == '>50K'
high_total_50k = len(df_higheredu[high_salary_50k])
high_total_50k

3486

In [9]:
higher_education = high_total_50k / higheredu_total * 100
higher_education

46.535843011613935

In [10]:
df_loweredu = df[~higher_education_check]
loweredu_total = len(df_loweredu)
loweredu_total

25070

In [11]:
low_salary_50k = df_loweredu['salary'] == '>50K'
low_total_50k = len(df_loweredu[low_salary_50k])
low_total_50k
#low_total_50k = len(df_higheredu[low_salary_50k])

4355

In [12]:
lower_education = low_total_50k / loweredu_total * 100
lower_education

17.3713601914639

### 3. What is the minimum number of hours a person works per week (hours-per-week feature)?

In [13]:
min_work_hours = df['hours-per-week'].min()
min_work_hours

1

### 4. What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [14]:
min_workhour_df = df[df['hours-per-week'] == min_work_hours]
len(min_workhour_df)

20

In [15]:
min_workhour_50K = min_workhour_df['salary'] == '>50K'
len(min_workhour_df[min_workhour_50K])

2

In [37]:
percent_ppl_minHour_50K = len(min_workhour_df[min_workhour_50K]) / len(min_workhour_df) * 100
print(percent_ppl_minHour_50K, "%")
min_workhour_df.head()

10.0 %

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
race,,,,,,,,,,,,,,
White,58,State-gov,109567,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,Male,0,0,1,United-States,>50K
White,66,Self-emp-inc,150726,9th,5,Married-civ-spouse,Exec-managerial,Husband,Male,1409,0,1,?,<=50K
White,69,?,195779,Assoc-voc,11,Widowed,?,Not-in-family,Female,0,0,1,United-States,<=50K
White,78,?,363134,HS-grad,9,Widowed,?,Not-in-family,Female,0,0,1,United-States,<=50K
White,45,?,189564,Masters,14,Married-civ-spouse,?,Wife,Female,0,0,1,United-States,<=50K

### 5. What country has the highest percentage of people that earn >50K?

In [17]:
df2 = pd.read_csv("adult.data.csv")

In [18]:
#country_df = df2.groupby(['native-country']).size()
df2.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [28]:
salary_count = df2.groupby(['native-country'], as_index = False)[['salary']].value_counts()

In [20]:
percentage_50k = []
percentage_50k_country = []
count = 0
for index in range(len(salary_count)):
    try:
        country = salary_count.loc[index,'native-country']
        count_below_50 = salary_count.loc[index,'count']
        count_above_50 = salary_count.loc[index+1,'count']
        above_50_percentage = count_above_50 / (count_above_50 + count_below_50) * 100
        if country not in percentage_50k_country:
            print (country, count_below_50, count_above_50, above_50_percentage)
            percentage_50k.append([country, above_50_percentage])

        percentage_50k_country.append(country)
        
    except KeyError:
        pass

? 437 146 25.04288164665523
Cambodia 12 7 36.84210526315789
Canada 82 39 32.231404958677686
China 55 20 26.666666666666668
Columbia 57 2 3.389830508474576
Cuba 70 25 26.31578947368421
Dominican-Republic 68 2 2.857142857142857
Ecuador 24 4 14.285714285714285
El-Salvador 97 9 8.49056603773585
England 60 30 33.33333333333333
France 17 12 41.37931034482759
Germany 93 44 32.11678832116788
Greece 21 8 27.586206896551722
Guatemala 61 3 4.6875
Haiti 40 4 9.090909090909092
Holand-Netherlands 1 12 92.3076923076923
Honduras 12 1 7.6923076923076925
Hong 14 6 30.0
Hungary 10 3 23.076923076923077
India 60 40 40.0
Iran 25 18 41.86046511627907
Ireland 19 5 20.833333333333336
Italy 48 25 34.24657534246575
Jamaica 71 10 12.345679012345679
Japan 38 24 38.70967741935484
Laos 16 2 11.11111111111111
Mexico 610 33 5.132192846034215
Nicaragua 32 2 5.88235294117647
Outlying-US(Guam-USVI-etc) 14 29 67.44186046511628
Peru 29 2 6.451612903225806
Philippines 137 61 30.808080808080806
Poland 48 12 20.0
Portugal 33 4 10.81081081081081
Puerto-Rico 102 12 10.526315789473683
Scotland 9 3 25.0
South 64 16 20.0
Taiwan 31 20 39.21568627450981
Thailand 15 3 16.666666666666664
Trinadad&Tobago 17 2 10.526315789473683
United-States 21999 7171 24.583476174151524
Vietnam 62 5 7.462686567164178
Yugoslavia 10 6 37.5

In [21]:
country_earning_df = pd.DataFrame(percentage_50k, columns =['Country Name','% earning above 50K'])
country_earning_df

                  Country Name  % earning above 50K
0                            ?            25.042882
1                     Cambodia            36.842105
2                       Canada            32.231405
3                        China            26.666667
4                     Columbia             3.389831
5                         Cuba            26.315789
6           Dominican-Republic             2.857143
7                      Ecuador            14.285714
8                  El-Salvador             8.490566
9                      England            33.333333
10                      France            41.379310
11                     Germany            32.116788
12                      Greece            27.586207
13                   Guatemala             4.687500
14                       Haiti             9.090909
15          Holand-Netherlands            92.307692
16                    Honduras             7.692308
17                        Hong            30.000000
18                     Hungary            23.076923
19                       India            40.000000
20                        Iran            41.860465
21                     Ireland            20.833333
22                       Italy            34.246575
23                     Jamaica            12.345679
24                       Japan            38.709677
25                        Laos            11.111111
26                      Mexico             5.132193
27                   Nicaragua             5.882353
28  Outlying-US(Guam-USVI-etc)            67.441860
29                        Peru             6.451613
30                 Philippines            30.808081
31                      Poland            20.000000
32                    Portugal            10.810811
33                 Puerto-Rico            10.526316
34                    Scotland            25.000000
35                       South            20.000000
36                      Taiwan            39.215686
37                    Thailand            16.666667
38             Trinadad&Tobago            10.526316
39               United-States            24.583476
40                     Vietnam             7.462687
41                  Yugoslavia            37.500000

In [38]:
country_earning_df = country_earning_df.sort_values('% earning above 50K', ascending = False)
country_earning_df.head()

                  Country Name  % earning above 50K
15          Holand-Netherlands            92.307692
28  Outlying-US(Guam-USVI-etc)            67.441860
20                        Iran            41.860465
10                      France            41.379310
19                       India            40.000000

In [23]:
country_earning_df.columns

Index(['Country Name', '% earning above 50K'], dtype='object')

In [24]:
country_earning_df['% earning above 50K'].head(1)

15    92.307692
Name: % earning above 50K, dtype: float64

In [25]:
country_earning_df['Country Name'].head(1)

15    Holand-Netherlands
Name: Country Name, dtype: object

### 6. Identify the most popular occupation for those who earn >50K in India.

In [26]:
df2.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [32]:
location_filter = df2["native-country"] == "India"
india_df = df2[location_filter]

salary_filter = india_df['salary'] == ">50K"
india_df = india_df[salary_filter]

india_occupations = india_df.value_counts('occupation')
india_occupations.head(1)

occupation
Prof-specialty    25
dtype: int64